cf/BusinessProcesses/ЗакупкаИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ЗакупкаИмпорт</Name>
			<BasedOn>
				<xr:Item>Document.Инвойс</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/BusinessProcesses/ЗакупкаИмпорт/Ext/ObjectModule.bsl
Процедура ИнвойсПроведенПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Инвойс.Проведен;
КонецПроцедуры

Процедура СебестоимостьРассчитанаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РасчетСебестоимости.Проведен;
КонецПроцедуры

Процедура ПоступлениеПроведеноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПоступлениеТоваров.Проведен;
КонецПроцедуры

Процедура КонтейнерРазложенПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанных = Тип("ДокументСсылка.Инвойс") Тогда

		Инвойс = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры
